Feature: Проверка авторизации и управления бронированием

  @HappyPath @Auth
  Scenario: Успешное получение токена и удаление бронирования
    Given выполнена успешная авторизация с логином "admin" и паролем "password123"
    And получен валидный токен авторизации
    When отправлен запрос на создание нового бронирования для пользователя "Anton" "Ivanov"
    Then бронирование успешно создано и получен его идентификатор
    When отправлен запрос на удаление созданного бронирования с использованием токена
    Then бронирование успешно удалено из системы со статусом 201
